export const tagColors = {
  명상: 'bg-[#1abc9c]', // 청록색 계열
  정신건강: 'bg-[#2ecc71]', // 연두색 계열
  챌린지: 'bg-[#f1c40f]', // 노란색 계열
  요가: 'bg-[#ff5733]', // 빨간색 계열
  운동: 'bg-[#e74c3c]', // 진한 빨간색 계열
  글쓰기: 'bg-[#2980b9]', // 파란색 계열
  자기계발: 'bg-[#9b59b6]', // 보라색 계열
  그림: 'bg-[#f39c12]', // 밝은 주황색 계열
  예술: 'bg-[#8e44ad]', // 진한 보라색 계열
  외국어: 'bg-[#16a085]', // 짙은 청록색 계열
  학습: 'bg-[#3498db]', // 파란색 계열
  식습관: 'bg-[#27ae60]', // 짙은 초록색 계열
  건강: 'bg-[#28b463]', // 초록색 계열
  자원봉사: 'bg-[#d35400]', // 짙은 주황색 계열
  사회공헌: 'bg-[#e67e22]', // 밝은 주황색 계열
  재테크: 'bg-[#f1c40f]', // 노란색 계열
  금융: 'bg-[#34495e]', // 어두운 회색 계열
  환경: 'bg-[#1e8449]', // 진한 초록색 계열
  지속가능성: 'bg-[#2ecc71]', // 연두색 계열
  스트레칭: 'bg-[#c0392b]', // 어두운 빨간색 계열
  다이어리: 'bg-[#8e44ad]', // 진한 보라색 계열
  사진: 'bg-[#e74c3c]', // 진한 빨간색 계열
  편집: 'bg-[#2c3e50]', // 짙은 회색 계열
  DIY: 'bg-[#f39c12]', // 밝은 주황색 계열
  창의력: 'bg-[#9b59b6]', // 보라색 계열
  음악: 'bg-[#34495e]', // 어두운 회색 계열
  취미: 'bg-[#16a085]', // 짙은 청록색 계열
  영화: 'bg-[#3498db]', // 파란색 계열
  계획: 'bg-[#2980b9]', // 진한 파란색 계열
  여행: 'bg-[#f1c40f]', // 노란색 계열
  요리: 'bg-[#e67e22]', // 밝은 주황색 계열
  레시피: 'bg-[#e74c3c]', // 진한 빨간색 계열
  정리: 'bg-[#27ae60]', // 짙은 초록색 계열
  청소: 'bg-[#16a085]', // 청록색 계열
  도전: 'bg-[#c0392b]', // 어두운 빨간색 계열
  자아: 'bg-[#8e44ad]', // 진한 보라색 계열
  발견: 'bg-[#9b59b6]', // 보라색 계열
  긍정: 'bg-[#f1c40f]', // 노란색 계열
  사고: 'bg-[#3498db]', // 파란색 계열
  가족: 'bg-[#27ae60]', // 초록색 계열
  시간: 'bg-[#34495e]', // 어두운 회색 계열
  기술: 'bg-[#34495e]', // 어두운 회색 계열
  배우기: 'bg-[#3498db]', // 파란색 계열
  소통: 'bg-[#9b59b6]', // 보라색 계열
  친구: 'bg-[#2980b9]', // 진한 파란색 계열
  자원: 'bg-[#27ae60]', // 짙은 초록색 계열
  관리: 'bg-[#f1c40f]', // 노란색 계열
  문화: 'bg-[#8e44ad]', // 진한 보라색 계열
  체험: 'bg-[#e67e22]', // 주황색 계열
  습관: 'bg-[#16a085]', // 청록색 계열
  독서: 'bg-[#3498db]', // 파란색 계열
  새로운: 'bg-[#9b59b6]', // 보라색 계열
  목표: 'bg-[#f1c40f]', // 노란색 계열
  설정: 'bg-[#2980b9]', // 진한 파란색 계열
  사람: 'bg-[#2ecc71]', // 연두색 계열
  대화: 'bg-[#8e44ad]', // 진한 보라색 계열
} as const;

export const tags = [
  '명상',
  '정신건강',
  '챌린지',
  '요가',
  '운동',
  '글쓰기',
  '자기계발',
  '그림',
  '예술',
  '외국어',
  '학습',
  '식습관',
  '건강',
  '자원봉사',
  '사회공헌',
  '재테크',
  '금융',
  '환경',
  '지속가능성',
  '스트레칭',
  '다이어리',
  '사진',
  '편집',
  'DIY',
  '창의력',
  '음악',
  '취미',
  '영화',
  '계획',
  '여행',
  '요리',
  '레시피',
  '정리',
  '청소',
  '도전',
  '자아',
  '발견',
  '긍정',
  '사고',
  '가족',
  '시간',
  '기술',
  '배우기',
  '소통',
  '친구',
  '자원',
  '관리',
  '문화',
  '체험',
  '습관',
  '독서',
  '새로운',
  '목표',
  '설정',
  '사람',
  '대화',
] as const;
